geosmall/tinyuf2/ports/stm32h7/boards.c
#include "stm32h7xx_hal.h"
#include "board_api.h"
#include <stdint.h>

#ifndef BUILD_NO_TINYUSB
#include "tusb.h"
#endif

#define STM32_UUID ((uint32_t *)0x1FF1E800)

#ifdef UART_DEV
static UART_HandleTypeDef UartHandle;
#endif

// fixes for linker warnings: _syscall is not implemented and will always fail
void __weak _close(void) {
}
void __weak _lseek(void) {
}
void __weak _read(void) {
}
void __weak _write(void) {
}
void __weak _fstat(void) {
}
void __weak _isatty(void) {
}

void board_init(void)
{
  SCB_EnableICache();
#ifndef RAMCODE
  SCB_EnableDCache();
#endif
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  clock_init();
  SystemCoreClockUpdate();
  SysTick_Config( (SystemCoreClock/1000) );

  // But some boards might end up using them
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();
  __HAL_RCC_GPIOK_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  // UART
  #ifdef UART_DEV
  UART_CLOCK_ENABLE();
  GPIO_InitStruct.Pin = UART_TX_PIN | UART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = UART_GPIO_AF;
  HAL_GPIO_Init(UART_GPIO_PORT, &GPIO_InitStruct);

  UartHandle.Instance = UART_DEV;
  UartHandle.Init.BaudRate = 115200;
  UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
  UartHandle.Init.StopBits = UART_STOPBITS_1;
  UartHandle.Init.Parity = UART_PARITY_NONE;
  UartHandle.Init.Mode = UART_MODE_TX_RX;
  UartHandle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;
  UartHandle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  UartHandle.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  UartHandle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  HAL_UART_Init(&UartHandle);
  #endif
  memset(&GPIO_InitStruct,0,sizeof(GPIO_InitStruct));
#ifdef BUTTON_PIN
  GPIO_InitStruct.Pin = BUTTON_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  // Use PULLUP for active-low buttons (BUTTON_STATE_ACTIVE=0)
  // Use PULLDOWN for active-high buttons (BUTTON_STATE_ACTIVE=1)
  #if BUTTON_STATE_ACTIVE == 0
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  #else
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  #endif
  HAL_GPIO_Init(BUTTON_PORT, &GPIO_InitStruct);
#endif

#ifdef LED_PIN
  GPIO_InitStruct.Pin = LED_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct);
#endif

#ifndef TINYUF2_SELF_UPDATE
  board_flash_early_init();
#endif // TINYUF2_SELF_UPDATE
}

// Configure USB for DFU
void board_dfu_init(void)
{
  // Not quite sure what an RHPORT is :/
#if defined (BOARD_TUD_RHPORT) && (BOARD_TUD_RHPORT == 0)
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  // Init USB Pins
  // Configure DM DP pins
  // ID line detection pin has to be initialized, or nothing works
  // mini-stm32h7 does not have this pin connected to anything
  GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG2_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  // https://community.st.com/s/question/0D50X00009XkYZLSA3/stm32h7-nucleo-usb-fs-cdc
  // TODO: Board init actually works fine without this line.
  HAL_PWREx_EnableUSBVoltageDetector();
  __HAL_RCC_USB2_OTG_FS_CLK_ENABLE();

  // No VBUS Sensing capabilities on the board
  // TODO: add a compile switch and Vbus sensing capability
  // Disable Vbus sense (B device) via pin PA9
  USB_OTG_FS->GCCFG &= ~USB_OTG_GCCFG_VBDEN;

  // B-peripheral session valid override enable
  USB_OTG_FS->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN;
  USB_OTG_FS->GOTGCTL |= USB_OTG_GOTGCTL_BVALOVAL;

#elif defined (BOARD_TUD_RHPORT) && (BOARD_TUD_RHPORT == 1)
  // TODO: implement whatever this is
  #error "Sorry, not implemented yet"
#endif

}

void board_reset(void)
{
  // Clean Cache
  SCB_CleanDCache();
  NVIC_SystemReset();
}

void board_dfu_complete(void)
{
  // Clean Cache
  SCB_CleanDCache();
  NVIC_SystemReset();
}

bool board_app_valid(void)
{
  uint32_t app_addr = board_get_app_start_address();
  uint32_t app_vector[2u] = { 0u, 0u };
  board_flash_read(app_addr, app_vector, 8u);

  TUF2_LOG1("AppChk: addr=%08lx SP=%08lx RST=%08lx\r\n", app_addr, app_vector[0], app_vector[1]);

  // 1st word (initial SP) should be in SRAM region and aligned
  // Use 0xFFF80003 mask for AXI SRAM to cover full 512KB range
  uint32_t sp_masked = app_vector[0] & 0xFFFF0003u;
  uint32_t sp_axi_masked = app_vector[0] & 0xFFF80003u;  // Covers 512KB AXI SRAM

  // Check AXI SRAM (512KB: 0x24000000-0x2407FFFF, SP can be at 0x24080000)
  if (sp_axi_masked == 0x24000000u || sp_axi_masked == 0x24080000u) {
    TUF2_LOG1("SP OK (AXI)\r\n");
  } else {
    // Check other RAM regions using the original mask
    switch (sp_masked)
    {
      case 0x00000000u: // ITCM 64K       [0x0000_0000u--0x0000_FFFFu]
      case 0x20010000u: // DTCM 64K       [0x2000_0000u--0x2000_FFFFu]
      case 0x20020000u: // DTCM 64K       [0x2001_0000u--0x2001_FFFFu]
      case 0x30010000u: // SRAM1 64K      [0x3001_0000u--0x3001_FFFFu]
      case 0x30020000u: // SRAM2 64K      [0x3002_0000u--0x3002_FFFFu]
      case 0x30030000u: // SRAM2 64K      [0x3003_0000u--0x3003_FFFFu]
      case 0x30040000u: // SRAM3 32K      [0x3004_0000u--0x3004_7FFFu]
      case 0x38000000u: // SRAM4 64K      [0x3800_0000u--0x3800_FFFFu]
      case 0x38800000u: // Backup SRAM 4K [0x3880_0000u--0x3880_0FFFu]
        break;
      default:
        return false;
    }
  }

  // 2nd word should be application reset

#ifdef BOARD_PFLASH_EN
  // H743 internal flash: Reset_Handler must be in flash (after bootloader)
  if (app_vector[1] >= BOARD_FLASH_APP_START &&
      app_vector[1] < (PFLASH_BASE_ADDR + BOARD_FLASH_SIZE))
  {
    return true;
  }
#else
  // If the Reset_Handler is in the later 64KB of PFLASH then it's valid
  if (IS_PFLASH_ADDR(app_addr) && (IS_PFLASH_ADDR(app_vector[1]))) return true;

  // If the Reset_Handler in QSPI in points to QSPI flash then it's valid
  if (IS_QSPI_ADDR(app_addr) && IS_QSPI_ADDR(app_vector[1])) return true;

  // If Reset_Handler in RAM points to RAM
  if (IS_AXISRAM_ADDR(app_addr) && IS_AXISRAM_ADDR(app_vector[1])) return true;
  // TODO: support downloads validation in other RAM regions as well
#endif

  return false;
}

void board_app_jump(void)
{
  // wrap up flash - qspi can go into mmap mode
  board_flash_deinit();

  // Get saved boot address
  uint32_t app_addr = board_get_app_start_address();
  volatile uint32_t const * app_vector = (volatile uint32_t const *) app_addr;

#ifdef BUTTON_PIN
  HAL_GPIO_DeInit(BUTTON_PORT, BUTTON_PIN);
#endif

#ifdef LED_PIN
  HAL_GPIO_DeInit(LED_PORT, LED_PIN);
#endif

  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOC_CLK_DISABLE();
  __HAL_RCC_GPIOD_CLK_DISABLE();
  __HAL_RCC_GPIOE_CLK_DISABLE();
  __HAL_RCC_GPIOF_CLK_DISABLE();
  __HAL_RCC_GPIOG_CLK_DISABLE();
  __HAL_RCC_GPIOH_CLK_DISABLE();
  __HAL_RCC_GPIOI_CLK_DISABLE();
  __HAL_RCC_GPIOJ_CLK_DISABLE();
  __HAL_RCC_GPIOK_CLK_DISABLE();
  // Lotsa GPIOs
uint8_t allow_rcc_deinit = 1;

// rcc clock needs to be enabled when executing code from external flash
#if defined(BOARD_QSPI_FLASH_EN) && (BOARD_QSPI_FLASH_EN == 1)
  allow_rcc_deinit = 0;
#endif

#if defined(BOARD_SPI_FLASH_EN) && (BOARD_SPI_FLASH_EN == 1)
  allow_rcc_deinit = 0;
#endif

  if (allow_rcc_deinit) {
    HAL_RCC_DeInit();
  }

  SCB_DisableICache();
  SCB_DisableDCache();

  // Clear temporary boot address
  board_clear_temp_boot_addr();

#ifdef UART_DEV
  HAL_UART_DeInit(&UartHandle);
  HAL_GPIO_DeInit(UART_GPIO_PORT, UART_TX_PIN | UART_RX_PIN);
  UART_CLOCK_DISABLE();
#endif

  // Set stack pointer
  __set_MSP(app_vector[0]);
  __set_PSP(app_vector[0]);

  TUF2_LOG1("App address: %08lx\r\n", app_vector[1]);

  // Setup VTOR to point to application vectors
  __DMB(); //ARM says to use a DMB instruction before relocating VTOR */
  SCB->VTOR = (uint32_t) app_addr;
  __DSB(); //ARM says to use a DSB instruction just after relocating VTOR */
  __ISB(); // Ensure instruction pipeline fetches from new VTOR

  // Jump to application reset vector
  asm("bx %0" :: "r"(app_vector[1]));

}

// USB Get_Serial response
uint8_t board_usb_get_serial(uint8_t serial_id[16])
{
  uint8_t const len = 12;
  memcpy(serial_id, STM32_UUID, len);
  return len;
}

//--------------------------------------------------------------------+
// Timer
//--------------------------------------------------------------------+

void board_timer_start(uint32_t ms)
{
  // TODO: check if ST HAL requires Systick timing to always be 1ms
  SysTick_Config((SystemCoreClock/1000) * ms);
}

void board_timer_stop(void)
{
  SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
}

int board_uart_write(void const * buf, int len)
{
#ifdef UART_DEV
  HAL_UART_Transmit(&UartHandle, (uint8_t*) buf, len, 0xFFFFFFFFU);
  return len;
#else
  (void) buf;
  (void) len;
  return 0;
#endif
}

//--------------------------------------------------------------------+
// CDC CLI
//--------------------------------------------------------------------+

#if CFG_TUD_CDC

static char _cli_buf[64];
static uint8_t _cli_pos = 0;

static void cli_print(const char* str) {
  size_t len = strlen(str);
  while (len > 0) {
    // Wait for buffer space
    while (tud_cdc_write_available() == 0) {
      tud_task();
    }
    uint32_t written = tud_cdc_write(str, len);
    str += written;
    len -= written;
  }
  tud_cdc_write_flush();
}

static void cli_process_command(void) {
  // Null-terminate and trim
  _cli_buf[_cli_pos] = '\0';

  // Skip empty commands
  if (_cli_pos == 0) {
    cli_print("> ");
    return;
  }

  // Process commands
  if (strcmp(_cli_buf, "help") == 0 || strcmp(_cli_buf, "?") == 0) {
    cli_print("\r\nCommands:\r\n");
    cli_print("  help   - Show this help\r\n");
    cli_print("  info   - Show bootloader info\r\n");
    cli_print("  erase  - Erase application flash\r\n");
    cli_print("  reset  - Reset to application\r\n");
  }
  else if (strcmp(_cli_buf, "info") == 0) {
    char buf[80];
    cli_print("\r\nTinyUF2 Bootloader\r\n");
    snprintf(buf, sizeof(buf), "Board:  %s\r\n", UF2_BOARD_ID);
    cli_print(buf);
    snprintf(buf, sizeof(buf), "Flash:  %luKB (app: %luKB at 0x%08lX)\r\n",
             (unsigned long)(BOARD_FLASH_SIZE / 1024),
             (unsigned long)((BOARD_FLASH_SIZE - (BOARD_FLASH_APP_START - 0x08000000)) / 1024),
             (unsigned long)BOARD_FLASH_APP_START);
    cli_print(buf);
    snprintf(buf, sizeof(buf), "USB:    %04X:%04X\r\n", USB_VID, USB_PID);
    cli_print(buf);
  }
  else if (strcmp(_cli_buf, "erase") == 0) {
    cli_print("\r\nErasing app flash...\r\n");
    board_flash_erase_app();
    cli_print("done.\r\n");
  }
  else if (strcmp(_cli_buf, "reset") == 0) {
    cli_print("\r\nResetting...\r\n");
    tud_cdc_write_flush();
    // Small delay to let USB flush
    for (volatile int i = 0; i < 100000; i++) {}
    NVIC_SystemReset();
  }
  else {
    cli_print("\r\nUnknown command. Type 'help' for list.\r\n");
  }

  cli_print("> ");
  _cli_pos = 0;
}

void cdc_task(void) {
  if (!tud_cdc_connected() || !tud_cdc_available()) {
    return;
  }

  while (tud_cdc_available()) {
    int32_t ch = tud_cdc_read_char();
    if (ch < 0) break;

    // Echo character
    if (ch == '\r' || ch == '\n') {
      tud_cdc_write_str("\r\n");
      tud_cdc_write_flush();
      cli_process_command();
    }
    else if (ch == '\b' || ch == 0x7F) {  // Backspace or DEL
      if (_cli_pos > 0) {
        _cli_pos--;
        tud_cdc_write_str("\b \b");  // Erase character on terminal
        tud_cdc_write_flush();
      }
    }
    else if (_cli_pos < sizeof(_cli_buf) - 1) {
      _cli_buf[_cli_pos++] = (char)ch;
      tud_cdc_write_char((char)ch);  // Echo
      tud_cdc_write_flush();
    }
  }
}

// Invoked when CDC line state changed (e.g., connected/disconnected)
void tud_cdc_line_state_cb(uint8_t instance, bool dtr, bool rts) {
  (void) instance;
  (void) rts;
  if (dtr) {
    cli_print("\r\nTinyUF2 Bootloader CLI\r\n");
    cli_print("Type 'help' for commands\r\n");
    cli_print("> ");
  }
}

#else

void cdc_task(void) {}

#endif // CFG_TUD_CDC

#ifdef TINYUF2_SELF_UPDATE
void board_self_update(const uint8_t * bootloader_bin, uint32_t bootloader_len)
{
  HAL_FLASH_Unlock();
  FLASH_EraseInitTypeDef flashErase = {0};
  flashErase.TypeErase = FLASH_TYPEERASE_MASSERASE;
  flashErase.Banks = FLASH_BANK_1;
  flashErase.Sector = FLASH_SECTOR_0;
  flashErase.NbSectors = 1;
  flashErase.VoltageRange = FLASH_VOLTAGE_RANGE_1;
  HAL_FLASHEx_Erase(&flashErase, NULL);
  for ( uint32_t i = 0; i < bootloader_len; i+= 4*FLASH_NB_32BITWORD_IN_FLASHWORD ) {
    if (HAL_OK != HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, 0x08000000U + i, (uint32_t) &bootloader_bin[i]))
    {
      TUF2_LOG1("Bootloader update failure\r\n");
      return;
    }
  }
  HAL_FLASH_Lock();
  board_reset();
}
#endif
